// напишите программу, которая задает массив из 8 элементов
// и выводит их на экране
//1,2,5,7,19[1,2,5,7,19]
//6,1,33 [6,1,33]
int []array=new int[8]{1,2,7,5,19,6,1,33};

for(int i=0;i<array.Length;i++)
{
Console.Write(array[i]+"\t");
}


    
